       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRIMEIRO-PROGRAMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-HOME PIC X(10).
       PROCEDURE DIVISION.
           DISPLAY "DIGITE O NOME: "
           ACCEPT WS-HOME
           DISPLAY "O NOME DIGITADO E: " WS-HOME
           STOP RUN.