       IDENTIFICATION DIVISION.
       PROGRAM-ID. cadastrarEndereco.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.

       PROCEDURE DIVISION.
       TELA-PRINCIPAL.
           DISPLAY "====================================="
           DISPLAY "         CADASTRAR ENDERECO          "
           DISPLAY "====================================="
           DISPLAY "Esta é a tela de Opcao 3."
           DISPLAY "Pressione Enter para voltar ao menu principal..."
           ACCEPT OMITTED
           GOBACK.
