       IDENTIFICATION DIVISION.
       PROGRAM-ID. gestaoFuncionario.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.

       PROCEDURE DIVISION.
       TELA-PRINCIPAL.
           DISPLAY "====================================="
           DISPLAY "       GESTAO DE FUNCIONARIO         "
           DISPLAY "====================================="
           DISPLAY "Esta é a tela de Opcao 1."
           DISPLAY "Pressione Enter para voltar ao menu principal..."
           ACCEPT OMITTED
           GOBACK.
