       IDENTIFICATION DIVISION.
       PROGRAM-ID. gestaoFornecedor.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.

       PROCEDURE DIVISION.
       TELA-PRINCIPAL.
           DISPLAY "====================================="
           DISPLAY "       GESTAO DE FORNECEDOR          "
           DISPLAY "====================================="
           DISPLAY "Esta é a tela de Opcao 2."
           DISPLAY "Pressione Enter para voltar ao menu principal..."
           ACCEPT OMITTED
           GOBACK.
