       IDENTIFICATION DIVISION.
       PROGRAM-ID. gestaoEstoque.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.

       PROCEDURE DIVISION.
       TELA-PRINCIPAL.
           DISPLAY "====================================="
           DISPLAY "          GESTAO DE ESTOQUE          "
           DISPLAY "====================================="
           DISPLAY "Esta é a tela de Opcao 4."
           DISPLAY "Pressione Enter para voltar ao menu principal..."
           ACCEPT OMITTED
           GOBACK.

